cruzerngz/MDP_STM32/stm32/Core/Src/move.c
        // move_forward_pid_cm(10);
		// osDelay(MOVE_PID_LOOP_PERIOD_TICKS);

        // for (uint8_t i = 0; i < 2; i++)
        // {
        //     move_turn_backward_pid_degrees(rev_dir, 11);
        //     osDelay(MOVE_PID_LOOP_PERIOD_TICKS);
        //     move_turn_forward_pid_degrees(for_dir, 11);
        //     osDelay(MOVE_PID_LOOP_PERIOD_TICKS);
        // }

        move_backward_pid_cm(20, false);
		// osDelay(MOVE_PID_LOOP_PERIOD_TICKS);
        return;
    }

	for (uint8_t i = 0; i < num_turns; i++)
	{
		move_turn_backward_pid_degrees(rev_dir, 11, false);
		osDelay(MOVE_PID_LOOP_PERIOD_TICKS);
		move_turn_forward_pid_degrees(for_dir, 11, false);
		osDelay(MOVE_PID_LOOP_PERIOD_TICKS);
	}

	// if(cardinal_direction == 4 || cardinal_direction == 12) move_backward_pid_cm(10);
}

// Move to minimum forward clearance from obstacle
// Calculated to be 25cm, approx 1 car length away
void move_to_obstacle(void)
{
	int32_t ir_diff = 0;
	int32_t ticks = 0;
	MotorDirection dir;
	do
	{
		ticks = osKernelGetTickCount();
		taskENTER_CRITICAL();
		ir_diff = (int32_t)(1250 - IR_ADC_AVERAGE_READOUT);
		taskEXIT_CRITICAL();

		// dir = ir_diff > 0 ? MotorDirForward : MotorDirBackward;
		// _set_motor_speed_pid(dir, MotorLeft, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S >> 1);
		// _set_motor_speed_pid(dir, MotorRight, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S >> 1);

		if (ir_diff > 0)
		{
			motor_forward(MotorSpeed1);
		}
		else
		{
			motor_backward(MotorSpeed1);
		}
		// osDelayUntil(ticks + 25);
		osDelayUntil(ticks + MOVE_PID_LOOP_PERIOD_TICKS);
	} while (abs(ir_diff) > 20);

	motor_stop();
}

// sets the motor speed for one motor for one PID iteration
void _set_motor_speed_pid(MotorDirection dir, MotorSide side, uint16_t speed_mm_s) {
	float current_error = (float)(speed_mm_s - abs(ENCODER_SPEED_DIRECTIONAL[side])); // target - current
	uint32_t current_time = osKernelGetTickCount();
	uint32_t iteration_ticks = 0;
	uint32_t new_pwm_val = 0;

	iteration_ticks = (uint32_t)(current_time - MOTOR_PREV_TICKS[side]);

	MOTOR_INTEGRATION_SUM[side] += (float)(current_error * iteration_ticks / 1000);

	new_pwm_val = (uint32_t)(
			MOVE_KP * current_error +
			MOVE_KI * MOTOR_INTEGRATION_SUM[side] +
			MOVE_KD * 1000 * (current_error - MOTOR_PREV_ERROR[side]) / iteration_ticks
	);

	MOTOR_PREV_ERROR[side] = current_error;
	MOTOR_PREV_TICKS[side] = current_time;

	_motor_set_pwm(dir, side, new_pwm_val);
}

// _set_motor_first_pwm_val(MotorDirection dir, MotorSide side, uint16_t speed_mm_s) {

// }

#define MOVE_PID_TURN_OUTER_MM_PER_DEGREE_WIDE 10.3f
#define MOVE_PID_TURN_REDUCTION_FACTOR_WIDE 0.751f



// move fastest task stuff
void _move_turn_wide(MoveDirection move_dir, MotorDirection dir, uint32_t speed_mm_s, uint32_t degrees, bool no_stop) {
	servo_point(move_dir, ServoMag3); // check the turn radius for this
	if(degrees < 10) speed_mm_s = speed_mm_s >> 1;
	uint32_t time_ticks = osKernelGetTickCount();
	uint32_t target_dist_mm = degrees * MOVE_PID_TURN_OUTER_MM_PER_DEGREE_WIDE * (1 + MOVE_PID_TURN_REDUCTION_FACTOR_WIDE);
	uint16_t left_motor_speed = move_dir == MoveDirLeft ? speed_mm_s * MOVE_PID_TURN_REDUCTION_FACTOR_WIDE : speed_mm_s;
	uint16_t right_motor_speed = move_dir == MoveDirRight ? speed_mm_s * MOVE_PID_TURN_REDUCTION_FACTOR_WIDE : speed_mm_s;
	volatile uint32_t *ENCODER_LEFT;
	volatile uint32_t *ENCODER_RIGHT;
	uint32_t total_dist = 0;

	_pid_reset(time_ticks);
	if(dir == MotorDirForward) {
		encoder_reset_counters_forward();
		ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_FORWARD;
		ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_FORWARD + 1;
	}
	if(dir == MotorDirBackward) {
		encoder_reset_counters_backward();
		ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_BACKWARD;
		ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_BACKWARD + 1;
	}

	if(no_stop == false) {osDelay(SERVO_FULL_LOCK_DELAY);}

	do {
		time_ticks = osKernelGetTickCount();

		taskENTER_CRITICAL();
		_set_motor_speed_pid(dir, MotorLeft, dir == MoveDirRight ? left_motor_speed * MOVE_OUTER_OVERDRIVE_RATIO : left_motor_speed);
		_set_motor_speed_pid(dir, MotorRight, dir == MoveDirLeft ? right_motor_speed * MOVE_OUTER_OVERDRIVE_RATIO : right_motor_speed);
		total_dist = *ENCODER_LEFT + *ENCODER_RIGHT;
		taskEXIT_CRITICAL();

		osDelayUntil(time_ticks + MOVE_PID_LOOP_PERIOD_TICKS);
	} while(total_dist < target_dist_mm);

	if(no_stop == false) {motor_stop();}
}


// Moves to the obstacle, 50cm away
void move_f_to_obstacle(void) {
	servo_point_center();

	uint16_t TARGET_IR_READOUT = 1900; // ir output at 50cm - calibrate!

	uint32_t time_ticks = osKernelGetTickCount();
	// uint32_t target = (uint32_t)dist_mm;
	volatile uint32_t *ENCODER_LEFT;
	volatile uint32_t *ENCODER_RIGHT;
	uint32_t total_dist = 0;
	int32_t ir_diff = 0;

	_pid_reset(time_ticks);
	encoder_reset_counters_forward();
	ENCODER_LEFT = ENCODER_POS_DIRECTIONAL_FORWARD;
	ENCODER_RIGHT = ENCODER_POS_DIRECTIONAL_FORWARD + 1;

	do {
		time_ticks = osKernelGetTickCount();

		ir_diff = (int32_t)(TARGET_IR_READOUT - IR_ADC_AVERAGE_READOUT);

		if(ir_diff < 0) {
			// this part turned off

			// taskENTER_CRITICAL();
			// _set_motor_speed_pid(MotorDirBackward, MotorLeft, (uint32_t)(MOVE_HIGH_SPEED_SLOW_TURN_MM_S >> 1) * MOVE_LEFT_MOTOR_MULTIPLIER);
			// _set_motor_speed_pid(MotorDirBackward, MotorRight, MOVE_HIGH_SPEED_SLOW_TURN_MM_S >> 1);
			// // total_dist = (*ENCODER_LEFT + *ENCODER_RIGHT) >> 1;
			// taskEXIT_CRITICAL();

			// this part turned off


		} else if(ir_diff > 0) {
			taskENTER_CRITICAL();
			_set_motor_speed_pid(MotorDirForward, MotorLeft, (uint32_t)(MOVE_HIGH_SPEED_SLOW_TURN_MM_S >> 1) * MOVE_LEFT_MOTOR_MULTIPLIER);
			_set_motor_speed_pid(MotorDirForward, MotorRight, MOVE_HIGH_SPEED_SLOW_TURN_MM_S >> 1);
			// total_dist = (*ENCODER_LEFT + *ENCODER_RIGHT) >> 1;
			taskEXIT_CRITICAL();
		}

		osDelayUntil(time_ticks + MOVE_PID_LOOP_PERIOD_TICKS);
	} while(abs(ir_diff) > 150); // while still in delay loop

	motor_stop();
}

// move inside the carpark
void move_f_to_carpark(void) {
	uint32_t TARGET_IR_READOUT = 1900;
	int32_t ir_diff = 0;
	int32_t ticks = 0;
	MotorDirection dir;
	do
	{
		ticks = osKernelGetTickCount();
		taskENTER_CRITICAL();
		ir_diff = (int32_t)(TARGET_IR_READOUT - IR_ADC_AVERAGE_READOUT);
		taskEXIT_CRITICAL();

		// dir = ir_diff > 0 ? MotorDirForward : MotorDirBackward;
		// _set_motor_speed_pid(dir, MotorLeft, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S >> 1);
		// _set_motor_speed_pid(dir, MotorRight, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S >> 1);

		if (ir_diff > 0)
		{
			motor_forward(MotorSpeed1);
		}
		else
		{
			motor_backward(MotorSpeed1);
		}
		// osDelayUntil(ticks + 25);
		osDelayUntil(ticks + MOVE_PID_LOOP_PERIOD_TICKS);
	} while (abs(ir_diff) > 100);

