cruzerngz/MDP_STM32/stm32/Core/Src/move.c
	motor_stop();
}



// high speed version of week 9 challenge
// small lane change operation - faster version
// change lane 25cm to the left/right
void move_f_operation_1_fast(uint16_t displacement, MoveDirection dir) {
	if(dir != MoveDirCenter)  {
		MOVE_F_OUTBOUND_LANE = dir;
	}
	MOVE_F_OBSTACLE_1_DISPLACEMENT = displacement; // store the obstacle displacement
	uint32_t diff = 0;
	if(displacement < 75) {
		diff = 75 - displacement;
		displacement = 75;
	}

	uint32_t forward_dist = (uint32_t)displacement * 0.98f - 55;
	switch(dir) {
		case MoveDirLeft:
			// move_turn_forward_pid_degrees(dir, 42, true);
			_move_turn(dir, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP1_FAST_TURN_LEFT_A1, true);
			// osDelay(50);
			// move_turn_forward_pid_degrees(dir == MoveDirLeft ? MoveDirRight : MoveDirLeft, 41, true);
			_move_turn(dir == MoveDirLeft ? MoveDirRight : MoveDirLeft, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP1_FAST_TURN_LEFT_A2, true);

			// move_forward_pid_cm((uint32_t)forward_dist * 0.9f, true); // multiplier accounts for "wheel slip"
			_move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S, forward_dist * 9, true);
			_pid_stop(MotorDirForward, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S, forward_dist);
			break;

		case MoveDirRight:
			// move_turn_forward_pid_degrees(dir, 35, true);
			_move_turn(dir, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP1_FAST_TURN_RIGHT_A1, true);

			// move_turn_forward_pid_degrees(dir == MoveDirLeft ? MoveDirRight : MoveDirLeft, 45, true);
			_move_turn(dir == MoveDirLeft ? MoveDirRight : MoveDirLeft, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP1_FAST_TURN_RIGHT_A2, true);

			// move_forward_pid_cm((uint32_t)forward_dist * 0.9f, true); // multiplier accounts for "wheel slip"
			_move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S, forward_dist * 9, true);
			_pid_stop(MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, forward_dist);
			// motor_stop_backward();
			// if(forward_dist != 0){ // 60 cm case
			// 	_pid_stop(MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, forward_dist);
			// } else {
			// 	motor_stop_backward();
			// }

			break;

		default: break;
	}

	if(diff != 0) {
		_move_in_direction_speed(MotorDirBackward, MOVE_HIGH_SPEED_SLOW_TURN_MM_S, diff * 10, false);
	}
}

// big lane change operation - faster version
void move_f_operation_2_fast(uint16_t displacement, MoveDirection dir) {
	uint32_t forward_dist = displacement - 30;
	MOVE_F_OBSTACLE_2_DISPLACEMENT = displacement; // store the obstacle displacment

	// move forward by 5cm, slower speed
	_move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, 5, true);
	if(dir == MOVE_F_OUTBOUND_LANE || dir == MoveDirCenter) { // if already in the lane, do a small lane change
		move_f_operation_1_fast(displacement + 20, dir); // change lane again by 25cm
		return;

	} else { // if in the wrong lane, do a big lane change (75cm)

		switch(dir) {
			case MoveDirLeft: // 75cm left lane change
				// move_turn_forward_pid_degrees(dir, 55, true);
				_move_turn(dir, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP2_FAST_TURN_LEFT_A1, true);

				// move_forward_pid_cm(35, true);
				_move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP2_FAST_TURN_LDISP, true);

				// move_turn_forward_pid_degrees(dir == MoveDirLeft ? MoveDirRight : MoveDirLeft, 70, true);
				_move_turn(dir == MoveDirLeft ? MoveDirRight : MoveDirLeft, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP2_FAST_TURN_LEFT_A2, true);

				// motor_stop();
				// servo_point_center();
				move_forward_pid_cm((uint16_t)(displacement - MOVE_F_OP2_FAST_TURN_LEFT_DISP), false);
				break;

			case MoveDirRight: // 75 cm right lane change
				// move_turn_forward_pid_degrees(dir, 55, true);
				_move_turn(dir, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP2_FAST_TURN_RIGHT_A1, true);

				// move_forward_pid_cm(35, true);
				_move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP2_FAST_TURN_RDISP, true);

				// move_turn_forward_pid_degrees(dir == MoveDirLeft ? MoveDirRight : MoveDirLeft, 70, true);
				_move_turn(dir == MoveDirLeft ? MoveDirRight : MoveDirLeft, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, MOVE_F_OP2_FAST_TURN_RIGHT_A2, true);

				// motor_stop();
				// servo_point_center();
				move_forward_pid_cm((uint16_t)(displacement - MOVE_F_OP2_FAST_TURN_RIGHT_DISP), false);
			break;

			default: break;
		}
	}

	MOVE_F_OUTBOUND_LANE = dir;
}

void move_f_operation_u_turn_fast(MoveDirection dir) {

	switch(dir) {
		case MoveDirLeft:
			_move_turn_wide(dir, MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S >> 1, MOVE_F_UTURN_FAST_LEFT, true);
			break;

		case MoveDirRight:
			_move_turn_wide(dir, MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S >> 1, MOVE_F_UTURN_FAST_RIGHT, true);
			break;
	}
}

// approach, u-turn and return trip - faster version
void move_f_operation_3_fast() {
	// homebound lane is opposite of the outbound lane, from start point perspective
	MoveDirection move_homebound_lane = MOVE_F_OUTBOUND_LANE == MoveDirLeft ? MoveDirRight : MoveDirLeft;
	// point back to center of carpark lot, and send it
	uint16_t carpark_angle = (uint16_t) tanh((float) 60/MOVE_F_OBSTACLE_1_DISPLACEMENT);
	uint16_t carpark_dist = (uint16_t) MOVE_F_OBSTACLE_1_DISPLACEMENT / cos(carpark_angle); // need to verify

	// u-turn
	move_f_operation_u_turn_fast(move_homebound_lane);

	if(MOVE_F_OBSTACLE_1_DISPLACEMENT + MOVE_F_OBSTACLE_2_DISPLACEMENT > 120) {
		uint32_t dist = MOVE_F_OBSTACLE_1_DISPLACEMENT + MOVE_F_OBSTACLE_2_DISPLACEMENT - 120;
		_move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S, dist * 9, true);
		_pid_stop(MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S, dist);
	}

	_move_turn(move_homebound_lane, MotorDirForward, MOVE_HIGH_SPEED_TURN_MM_S, 15, true);
	_move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S, 1000, true);
	// _pid_stop(MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S, 100);

	// // obstacle 1
	// _move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S, MOVE_F_OBSTACLE_2_DISPLACEMENT * 5, true);
	// _move_in_direction_speed(MotorDirForward, MOVE_DEFAULT_SPEED_TURN_MM_S, MOVE_F_OBSTACLE_2_DISPLACEMENT * 5, true);
	// // go home
	// move_turn_forward_pid_degrees(move_homebound_lane, carpark_angle, false); // fixed, should be using carpark_angle
	// // move_forward_pid_cm((uint32_t)carpark_dist * 0.9f, true);
	// _move_in_direction_speed(MotorDirForward, MOVE_HIGH_SPEED_STRAIGHT_MM_S, carpark_dist * 9, true);
	// _pid_stop(MotorDirForward, MOVE_DEFAULT_SPEED_STRAIGHT_MM_S, carpark_dist);

	// park in front (disabled for now)
	move_f_to_obstacle();
}



// normal speed version of week 9 challenge
// small lane change operation - faster version


void move_f_operation_1(uint16_t displacement, MoveDirection dir) {
	if(dir != MoveDirCenter)  {
		MOVE_F_OUTBOUND_LANE = dir;
	}
	MOVE_F_OBSTACLE_1_DISPLACEMENT = displacement; // store the obstacle displacement

